Revit 2025 API
TessellatedShapeBuilderOutcome Enumeration
 Describes the outcome of TessellatedShapeBuilder attempt to build geometrical objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TessellatedShapeBuilderOutcome
Public Enumeration TessellatedShapeBuilderOutcome
public enum class TessellatedShapeBuilderOutcome
type TessellatedShapeBuilderOutcome
Members
Member name | Value | Description
Mesh | 1 |  A mesh was created
Mixed | 2 |  A geometry and a mesh were created
Nothing | 3 |  Nothing was built.
Solid | 4 |  A solid geometry was created.
Sheet | 5 |  An open sheet was created.
See Also
Reference
Autodesk.Revit.DB Namespace